import React from 'react';
import '../style/G5Modal.css';

const G5Modal = ({ isOpen, onClose }) => {
    if (!isOpen) return null;

    return (
        <div className="modal-overlay">
            <div className="modal">
                <button className="close-button" onClick={onClose}>
                    &times;
                </button>
                <div className="modal-content">

                    <h2>راهنما</h2>
                   <h4> استفاده از جعبه ۱</h4>

                    <p>جعبه ۱، همچنین به عنوان “جعبه هر روز” شناخته می‌شود، چیزی است که شما، برای آموزش زبان انگلیسی، به طور روزانه مرور می‌کنید. همه کارت‌های تازه ایجاد شده به‌طور خودکار وارد این جعبه می‌شوند، همراه با کارت‌هایی که از کادر ۲ و ۳ به اشتباه پاسخ داده شده‌اند. با بازگشت مداوم به کادر ۱ و مرور فلش کارت‌های درون آن، در نهایت سخت‌ترین مفاهیمی را که نمی‌توانستید به خاطر بسپرید را یاد خواهید گرفت.</p>
                    <h4>استفاده از جعبه ۲</h4>

                    <p>
                  جعبه ۲ جایی است که شما فلش کارت‌هایی را به درستی پاسخ دادید را پیدا خواهید کرد. ایده پشت این کار آن است که چون می‌توانید این فلش کارت‌ها را به خاطر بسپارید، دیگر نیازی به مرور روزانه آن‌ها ندارید. در عوض، باید دفعات بازبینی را کاهش دهید و کارت‌ها را یک روز در میان مرور کنید. این مورد به شما امکان می‌دهد زمان و انرژی بیشتری را به کارت‌هایی اختصاص دهید که با آن‌ها مشکل دارید.
              </p>
                    <h4>استفاده از جعبه ۳</h4>
                    <p>
                        جعبه فلش کارت نهایی سیستم لایتنر، کادر ۳ بوده و جعبه‌ای است که کمترین دفعات از آن استفاده می‌کنید و بازبینی فقط یک بار در هفته انجام می‌شود. این کار به آن دلیل انجام می‌شود که زمان غیرضروری را با استفاده از تکرارهای فاصله دار روی مفاهیم از قبل تسلط یافته تلف نکنید.
                    </p>
                </div>
            </div>
        </div>
    );
};

export default G5Modal;
